#В зависимости от выбора пользователя вычислить S круга, прямоугольника или треугольника.
# Для вычисления площади каждой фигуры должна быть написана отдельная функция

#Тут в качестве формулы площади треугольника - брать формулу S = 0.5 * основание * высота.
# Остальные формулы вы сможете найти в интернете
import math
n=input("Введите фигуру: ")
def sRing(r):
    s=math.pi*r**2
    return s
def sRectangle(a, b):
    return a*b
def sTreangle(a,b): return a*b/2


if n=="круг":
    r=int(input("Радиус круга: "))
    print(sRing(r))
elif n=="прямоугольник":
    a=int(input("Сторона а прямоугольника: "))
    b=int(input("Сторона b прямоугольника: "))
    print(sRectangle(a, b))
elif n=="треугольник":
    a=int(input("Основание а треугольника: "))
    h=int(input("Высота h треугольника: "))
    print(sTreangle(a, h))
else: print("В базе нет токай фигуры")
