#Вычислить значение нижеприведенной функции в диапазоне значений от -10 до 10 включительно с шагом, равным 1. 
#y=x^2 при -5<=х<=5;
#y=2*|x|-1 при х<-5;
#y=2x при х>5;
#Вычисление значения функции оформить в виде программной функции, которая принимает значение х, а влзвращает полученное значение функции (у)

#Тут вам задана кусочков-заданная  математическая функция. 
#Которая в зависимости от значения аргумента исчисляется по разному. Решить ее используя функцию с if выражениями. 

#|х| - это абсолютное значение числа(модуль). 
#Для его применения используйте встроенную функцию питона (Гугл в помощь)

x=int(input("Введите число х в интервале [-10; 10]: "))

def funY(x):
    if x<=5 and x>=-5 : y=x**2
    elif x<-5 and x>-10: y=2*abs(x)-1
    elif x>5 and x<10: y=2*x
    else:     
        y=False
        print("Ваша число не входит в интервал")
    return y
print("Функция Y равна: ", funY(x))